{
  "backend/main.mo": "Motoko canister defining user profiles, help requests, lesson categories, lessons, and custom sorting with access control mixin.",
  "feature_evidence.json": "Structured feature evidence listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file providing one‑sentence summaries for all major frontend components and pages.",
  "frontend/index.css": "Global Tailwind CSS setup defining base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps all pages in the AppLayout component.",
  "frontend/src/components/AppLayout.tsx": "Shared layout with header navigation, footer, and active‑state handling for top‑level routes.",
  "frontend/src/components/BrandLogo.tsx": "Simple logo component rendering a static image asset.",
  "frontend/src/components/guided-form/formTemplates.ts": "Defines preset form templates with fields, metadata, and options for job applications, surveys, and registrations.",
  "frontend/src/components/guided-form/GuidedFormWizard.tsx": "Implements a multi‑step guided form wizard with form selection, field navigation, validation, and review state management.",
  "frontend/src/components/guided-form/types.ts": "Declares TypeScript types for form templates, field definitions, form data, and validation results.",
  "frontend/src/components/guided-form/validators.ts": "Provides field‑level and full‑form validation logic for required fields, emails, and phone numbers.",
  "frontend/src/components/learn/LearnHero.tsx": "Renders the hero section for the Learn page with a title, description, and illustration.",
  "frontend/src/components/learn/LessonListByCategory.tsx": "Displays lessons grouped by category with loading states, expandable category selection, and links to lesson pages.",
  "frontend/src/components/learn/ScamAwarenessChecklist.tsx": "Shows a checklist of red and green flags for scam awareness using styled list items.",
  "frontend/src/components/support/HelpRequestForm.tsx": "Implements a help request form with validation, submission handling, and a success message state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking. Wraps Dfinity AuthClient with custom options and exposes a hook for consuming identity state.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching lesson categories, lessons, disclaimers, support info, and submitting help requests using an actor backend. Each hook manages enabled states and error handling.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for light and dark themes with green/orange accents. Applies global background, text, and border styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering. Imports global styles and the root App component.",
  "frontend/src/pages/ContactSupportPage.tsx": "Displays support contact info, response/privacy notes, a safety reminder card, and a help request form. Uses React Query to load backend support text.",
  "frontend/src/pages/GuidedFormFillingPage.tsx": "Renders an introduction and explanation of the guided form-filling tool, followed by the guided form wizard component. Emphasizes step‑by‑step form assistance.",
  "frontend/src/pages/LearnPage.tsx": "Shows a hero section, disclaimer alert, scam checklist, and a list of lessons grouped by category. Loads categories and disclaimer via React Query with skeletons during loading.",
  "frontend/src/pages/LessonDetailPage.tsx": "Displays a detailed lesson view with tags, difficulty, reading‑time estimate, disclaimer, and full lesson content. Handles loading and not‑found states and includes a scam awareness checklist.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash params, persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, typography, animations, and plugins.",
  "project_state.json": "Project metadata describing app purpose, existing features, image requirements, and pending feature requests."
}