{
  "backend/main.mo": "Motoko backend actor managing user profiles, help requests, lesson categories, and lessons with sorting utilities and access control mixin.",
  "feature_evidence.json": "Feature evidence report mapping hero image update tasks to the LearnHero.tsx file with linked components and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all major frontend components, pages, hooks, and configuration files.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark mode using OKLCH color values.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for learn, lesson detail, guided forms, and contact pages wrapped in AppLayout.",
  "frontend/src/components/AppLayout.tsx": "Global layout with header navigation, logo, main content slot, and footer with links and social icons.",
  "frontend/src/components/BrandLogo.tsx": "Renders the static app logo image with alt text.",
  "frontend/src/components/guided-form/formTemplates.ts": "Defines predefined form templates with fields for job applications, surveys, and registrations.",
  "frontend/src/components/guided-form/GuidedFormWizard.tsx": "Multi-step guided form wizard handling form selection, field entry, validation, review, and WhatsApp CTA.",
  "frontend/src/components/guided-form/types.ts": "Declares TypeScript types for form templates, fields, form data, and validation results.",
  "frontend/src/components/guided-form/validators.ts": "Provides field and form validation logic for required fields, email, and phone formats.",
  "frontend/src/components/learn/LearnHero.tsx": "Renders the hero section for the learning page with a title, description, and hero image.",
  "frontend/src/components/learn/LessonListByCategory.tsx": "Displays lessons filtered by category with loading states, tags, and navigation links.",
  "frontend/src/components/learn/ScamAwarenessChecklist.tsx": "Shows a checklist of red and green flags to identify potential scams.",
  "frontend/src/components/support/HelpRequestForm.tsx": "Implements a contact form with validation, submission handling, and success feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login state and AuthClient behavior.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching lesson categories, lessons, disclaimers, support info, and submitting help requests via an actor instance.",
  "frontend/src/index.css": "Sets global Tailwind base styles and defines light/dark theme CSS variables for colors, borders, and UI elements.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/ContactSupportPage.tsx": "Displays support contact info, safety reminders, and a help request form using data from React Query.",
  "frontend/src/pages/GuidedFormFillingPage.tsx": "Renders an overview and a guided form wizard for step-by-step form assistance.",
  "frontend/src/pages/LearnPage.tsx": "Loads and displays the learning disclaimer, scam checklist, and lesson categories with loading states.",
  "frontend/src/pages/LessonDetailPage.tsx": "Shows detailed lesson content with tags, reading time, disclaimer, and safety checklist, handling loading and missing lessons.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins including container queries and animate.",
  "project_state.json": "Describes project metadata, existing feature requirements, and image handling instructions for a hero image replacement task."
}