{
  "backend/main.mo": "Actor defining access control, user profiles, help requests, lesson categories, and lessons with comparison utilities and initial seeded data.",
  "feature_evidence.json": "Report mapping features to affected files, components, and test IDs for version 2 release validation.",
  "frontend-file-summaries.txt": "List of frontend file paths with brief summaries describing each component or script's purpose.",
  "frontend/DEPLOYMENT.md": "Deployment guide documenting versioning, current version 2 features, and release procedures.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React app with root container and main script.",
  "frontend/public/app-version.txt": "Static file declaring Version 2, build date, and core application routes.",
  "frontend/scripts/postdeploy-smoke-check.mjs": "Node script that checks core app routes over HTTP/HTTPS to validate deployment health.",
  "frontend/scripts/SMOKE_CHECK_PRODUCTION.md": "Runbook describing how to execute and interpret the production smoke check.",
  "frontend/src/App.tsx": "Main router setup defining root layout and all routes including learn, guided forms, contact, and lesson detail.",
  "frontend/src/components/AppLayout.tsx": "Layout component providing header navigation, main content wrapper, and footer with links and branding.",
  "frontend/src/components/BrandLogo.tsx": "Component rendering the app’s logo image.",
  "frontend/src/components/guided-form/formTemplates.ts": "Defines predefined form templates with fields, metadata, and examples for guided form creation.",
  "frontend/src/components/guided-form/GuidedFormWizard.tsx": "Implements a multi‑step guided form wizard with field navigation, validation, and review flow.",
  "frontend/src/components/guided-form/types.ts": "Provides TypeScript types for form templates, fields, form data, and validation results.",
  "frontend/src/components/guided-form/validators.ts": "Contains validation logic for individual fields and entire forms including email and phone checks.",
  "frontend/src/components/learn/LearnHero.tsx": "Displays a hero section for the Learn page with a heading, description, and image.",
  "frontend/src/components/learn/LessonListByCategory.tsx": "Renders lessons filtered by category with loading states, category tabs, and lesson previews.",
  "frontend/src/components/learn/ScamAwarenessChecklist.tsx": "Shows a checklist highlighting scam red flags and trustworthy green flags.",
  "frontend/src/components/support/HelpRequestForm.tsx": "Provides a help request form with validation, submission handling, and success feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on authentication state and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication and exposes login, logout, identity state, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching lesson data, disclaimer text, support info, and submitting help requests through an actor.",
  "frontend/src/index.css": "Configures Tailwind styles and theme variables for light and dark modes with custom color tokens and utilities.",
  "frontend/src/main.tsx": "Bootstraps the app by rendering it inside React Query and Internet Identity providers.",
  "frontend/src/pages/ContactSupportPage.tsx": "Displays support contact information, a safety reminder, and a help request form using server‑fetched data.",
  "frontend/src/pages/GuidedFormFillingPage.tsx": "Shows an introduction to guided form filling and renders the multi‑step form wizard component.",
  "frontend/src/pages/LearnPage.tsx": "Loads and displays the disclaimer, scam awareness checklist, and lesson categories for browsing learning resources.",
  "frontend/src/pages/LessonDetailPage.tsx": "Fetches and displays lesson details with reading time, tags, disclaimer, and a checklist, handling loading and missing lessons.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), persist them in sessionStorage, and remove them from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, animations, and plugin setup.",
  "project_state.json": "Describes the project’s current state, existing features, and pending deployment request for Version 2."
}