{
  "kind": "build_request",
  "title": "Replace selected hero image with uploaded logo graphic",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the selected <img> element (XPath: /html[1]/body[1]/div[1]/div[1]/main[1]/div[1]/div[1]/div[1]/div[1]/div[2]/img[1]) in the Learn page hero so it displays the newly uploaded logo graphic instead of the current hero illustration.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Logo"
        ]
      },
      "acceptanceCriteria": [
        "The Learn page hero image no longer uses /assets/generated/hero-illustration.dim_1600x900.png.",
        "The selected hero <img> uses a new static asset in frontend/public/assets/generated and renders without layout breakage (keeps responsive sizing and rounded/shadow styling)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Set the updated hero image alt text to clear English describing the uploaded logo graphic (do not include personal names).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Logo"
        ]
      },
      "acceptanceCriteria": [
        "The hero image alt text is in English and does not contain personal names.",
        "Lighthouse/axe checks for missing alt text pass for this image."
      ]
    }
  ],
  "constraints": [
    "Apply changes only to the user-selected element (the Learn page hero image at the provided XPath).",
    "Do not modify files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not change the header app logo (BrandLogo) unless explicitly requested.",
    "Do not add new backend logic or data models.",
    "Do not update other images or page sections besides the selected hero image."
  ],
  "imageRequirements": {
    "required": [
      "Create a landscape-cropped/letterboxed version of the uploaded graphic with centered emblem and text on a clean background (hero-guidance-logo.dim_1600x900.png)."
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}