{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update brand name to \"learning& Earning\" across header, footer, logo alt, and document title",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Change header brand text next to the logo to exactly \"learning& Earning\".",
      "acceptanceCriteria": [
        "Header branding text next to the logo displays exactly \"learning& Earning\" (including case and ampersand).",
        "No occurrences of the previous header brand name remain visible in the header across routes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Update the header brand <span> text rendered next to <BrandLogo /> from the previous name to exactly \"learning& Earning\" so it is consistent across all routes using AppLayout."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Change footer copyright brand name to exactly \"learning& Earning\" while keeping the year automatic.",
      "acceptanceCriteria": [
        "Footer line reads \"© <current year> learning& Earning. All rights reserved.\" (with the year continuing to update automatically)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Update the footer copyright line to use exactly \"learning& Earning\" while preserving the existing automatic year rendering."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Update the logo image alt text to reflect the new brand name exactly: \"learning& Earning\".",
      "acceptanceCriteria": [
        "The logo <img> alt text includes the exact brand name \"learning& Earning\" and does not reference the previous brand name."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BrandLogo.tsx",
          "operation": "modify",
          "description": "Change the <img> alt text to include the exact brand name \"learning& Earning\" (and remove any reference to the previous brand name)."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Set the HTML document title to exactly \"learning& Earning\".",
      "acceptanceCriteria": [
        "The <title> in frontend/index.html is exactly \"learning& Earning\".",
        "Refreshing the page shows the updated tab title in the browser."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Replace the existing <title> text with exactly \"learning& Earning\"."
        }
      ]
    }
  ]
}